{
  "backend/main.mo": "Main canister actor defining user profiles, habits, records, monthly targets, lifetime totals, and authorization-gated CRUD APIs.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by adding monthlyTargets and lifetimeTotal maps.",
  "feature_evidence.json": "Feature evidence report mapping new features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the application.",
  "frontend/index.css": "Tailwind-based global style definitions using OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, profile loading, and routing to login, setup, or dashboard.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "A collapsible UI panel that toggles visibility of the HabitManager component for adding and managing habits.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches render errors and displays a custom fallback UI.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fallback UI for fatal errors showing an error message with options to reload or retry.",
  "frontend/src/components/HabitGrid.tsx": "Renders a calendar-style grid of habits, allowing toggling completion and editing numeric or time-based amounts. Uses records to map daily completion state and updates via mutation hooks.",
  "frontend/src/components/HabitManager.tsx": "Provides UI to create, edit, and delete habits, including weekly targets, units, and default amounts. Validates inputs and updates habits through mutation hooks.",
  "frontend/src/components/Header.tsx": "Displays app header with user info, view-mode switching, report export, theme toggle, and logout. Integrates dropdown and icon controls for navigation.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Shows an investment goal with progress, and supports editing, deleting, and adding contributions via dialogs. Uses mutation hooks to update or remove goals.",
  "frontend/src/components/InvestmentsPage.tsx": "Lists investment goals and provides a form to create new ones. Handles input validation and interacts with backend via query and mutation hooks.",
  "frontend/src/components/LoginScreen.tsx": "Displays login screen for Internet Identity authentication with branding and a login button. Shows loading state during login attempts.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "UI for viewing and editing monthly habit targets, including auto-plan defaults and saving changes via mutation.",
  "frontend/src/components/MonthTabs.tsx": "Provides horizontally scrollable month tabs allowing selection of a month. Uses tab components to trigger month changes.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form allowing users to enter and save their name.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly and lifetime habit progress visualizations with charts and progress stats.",
  "frontend/src/components/ReportExportDialog.tsx": "Dialog for exporting habit data to CSV with date range selection and optional habit filtering.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard combining habit management, targets, tracking grid, and progress charts with month navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity persistence handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, habits, and related habit data through the actor API.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining theme colors for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/types/jspdf.d.ts": "Placeholder TypeScript declaration file for jsPDF types.",
  "frontend/src/utils/duration.ts": "Parses free‑text duration strings into seconds, formats seconds to readable strings, and validates duration input.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames based on date ranges for CSV or PDF downloads.",
  "frontend/src/utils/habitUnit.ts": "Helpers for converting, labeling, creating, and identifying habit unit types.",
  "frontend/src/utils/reportCsv.ts": "Builds CSV export content from habit data and triggers CSV file download.",
  "frontend/src/utils/reportDateRange.ts": "Utility functions for converting dates to UTC components and formatting UTC dates.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder for PDF report generation utilities.",
  "frontend/src/utils/reportStats.ts": "Computes report statistics including habit performance, daily stats, and volume metrics over a date range.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH-based color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing a habit-tracking app with monthly targets, auto-progression defaults, lifetime totals, existing features, and pending backend feature requests."
}