{
  "backend/main.mo": "Motoko canister implementing the habit tracker backend with access control, user profiles, habits with per-habit units, and daily habit records supporting optional numeric amounts, including migration support on upgrade.",
  "backend/migration.mo": "Defines upgrade migration logic to transform old habit and record data into the new schema by adding default habit units and optional amount fields to records.",
  "feature_evidence.json": "Machine-readable report listing implemented frontend features related to habit units, optional amounts, progress visualization, and exports, with referenced files, dependencies, and test requirements.",
  "frontend-file-summaries.txt": "Consolidated overview of all frontend source files with brief descriptions of their responsibilities, covering authentication, habit tracking UI, progress visualization, exports, and utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, color themes, dark mode variables, and base styles for the application.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React application and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, profile setup flow, theme provider, and conditional rendering of login, setup, or main dashboard.",
  "frontend/src/components/HabitGrid.tsx": "Interactive monthly grid for tracking daily habit completion with checkboxes and popovers to optionally enter or edit numeric amounts per day using the habit’s unit.",
  "frontend/src/components/HabitManager.tsx": "Provides UI and logic to create, edit weekly targets, and delete habits, including unit selection and validation, using React Query hooks and toast feedback.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, user greeting, theme toggle, CSV export access, and a user menu with logout.",
  "frontend/src/components/LoginScreen.tsx": "Displays the login landing page and triggers Internet Identity authentication with a loading state.",
  "frontend/src/components/MonthTabs.tsx": "Shows a horizontally scrollable tab selector for months and notifies parent when the selected month changes.",
  "frontend/src/components/ProfileSetup.tsx": "Collects and saves the user's name to create their profile, with form validation and success/error toasts.",
  "frontend/src/components/ProgressCharts.tsx": "Calculates and visualizes monthly habit progress using pie, bar, and line charts based on habits and records.",
  "frontend/src/components/ReportExportDialog.tsx": "Implements a dialog to export habit data as CSV for a date range, supporting all or selected habits with validation and download.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard layout that wires together header, habit management, monthly tracking grid, progress charts, and logout handling.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches a backend actor based on the current Internet Identity, handling anonymous vs authenticated actors and initializing access control. It invalidates and refetches dependent React Query queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider using Dfinity AuthClient to manage login, logout, persisted identity, and detailed login status flags. Exposes a hook for accessing the identity and authentication actions throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of React Query hooks for fetching and mutating user profiles, habits, records, and exports via the backend actor. Each hook handles cache invalidation and depends on the availability of the actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a comprehensive set of CSS variables for light and dark themes, including colors, radius, and chart styles. Applies base background, text, and border styles globally.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers. Initializes a shared QueryClient and imports global styles.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file reserved for jsPDF type definitions or module augmentation.",
  "frontend/src/utils/fileDownload.ts": "Utility for generating standardized export filenames based on date ranges and format (CSV or PDF). Encodes start and end dates into the filename.",
  "frontend/src/utils/habitUnit.ts": "Helper functions for creating habit unit objects and converting HabitUnit values into human-readable or short labels. Supports reps, time, and custom units.",
  "frontend/src/utils/reportCsv.ts": "Generates a CSV export string for habit tracking data including profile info, habits, and records, and provides a browser download helper. Formats dates and units consistently for reporting.",
  "frontend/src/utils/reportDateRange.ts": "Utilities for converting Date objects into UTC date components, formatting dates, and deriving structured date ranges. Used to ensure consistent UTC-based reporting.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder file intended for future PDF report generation logic.",
  "frontend/src/utils/reportStats.ts": "Calculates aggregated statistics for reports, including overall completion, per-habit stats, daily completion percentages, and volume metrics. Processes habits and records over a given date range to produce structured report data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them with URL values taking precedence. Includes logic to safely remove sensitive parameters from the URL hash after extraction.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with CSS-variable-driven colors, layout settings, animations, and radii. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, versioning, and feature inventory for the Consistency Tracker ICP app. Describes authentication, role-based access control, habit tracking, on-chain persistence, and reporting features implemented to date."
}