{
  "backend/main.mo": "Motoko backend defining user profiles, habits, records, diary entries, investment tracking, authorization, and diagnostics with maps and list-based storage.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for version-restore and initialization verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens for light and dark themes and applying base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication flow, profile loading, and routing to login, profile setup, or dashboard.",
  "frontend/src/components/__tests__/tracker-spacing.regression.test.tsx": "Empty test file placeholder.",
  "frontend/src/components/AuthenticatedInitFallback.tsx": "Fallback UI shown when authenticated initialization fails, offering retry, reload, and diagnostics display.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Collapsible panel that loads and displays the HabitManager component with loading state handling.",
  "frontend/src/components/DiaryAnalyticsChart.tsx": "Builds a line chart comparing daily energy levels with habit consistency using diary entries and habit records.",
  "frontend/src/components/DiaryPage.tsx": "Provides a diary entry interface with date selection, parsing/saving entry fields, and displays an analytics chart.",
  "frontend/src/components/ErrorBoundary.tsx": "Implements a React error boundary that renders a fallback UI and allows resetting error state.",
  "frontend/src/components/ExportDataPage.tsx": "Loads data for a selected date range and enables exporting all user data to XLSX or PDF.",
  "frontend/src/components/ExportDateRangePicker.tsx": "Renders a dual date picker ensuring valid start/end order and notifies parent of range changes.",
  "frontend/src/components/ExportPreviewSections.tsx": "Displays preview sections for reflections, habit records, and investment data within an export range.",
  "frontend/src/components/FatalErrorFallback.tsx": "Shows a full-screen fatal error message with options to reload or retry after an unrecoverable error.",
  "frontend/src/components/HabitGrid.tsx": "Renders a scrollable grid of habits by day, mapping records to cells and supporting toggling completion and editing amounts. Manages scroll position and record state for a selected month and year.",
  "frontend/src/components/HabitManager.tsx": "Provides UI to create, edit, and delete habits, including name, weekly target, unit, and default amount. Validates inputs and uses backend mutation hooks.",
  "frontend/src/components/Header.tsx": "Displays the app header with user info, logout menu, and navigation tabs. Shows view-specific icon and title based on the current selection.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Shows an individual investment goal with progress, edit and delete dialogs, and form validation. Updates or removes goals via mutation hooks.",
  "frontend/src/components/InvestmentsPage.tsx": "Lists investment goals and provides a dialog to create new ones with validation. Fetches goals and displays loading feedback.",
  "frontend/src/components/LoadingTimeoutFallback.tsx": "Displays a fallback screen when loading times out, with backend reachability diagnostics and options to reload or proceed to login. Supports copying detailed diagnostic info.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component handling Internet Identity auth state and rendering UI for login and error messages.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Displays monthly target and progress totals for applicable habits, computing sums and steady-climb targets.",
  "frontend/src/components/MonthTabs.tsx": "Renders horizontally scrollable month selector tabs and notifies parent on month change.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing a user to submit their name and save it via backend mutation.",
  "frontend/src/components/ProgressCharts.tsx": "Computes monthly progress stats and renders pie, bar, and line charts for overall and per‑habit performance.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard managing views, month selection, data fetching, and rendering habit grid, targets, and charts.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity state and refreshes dependent queries.",
  "frontend/src/hooks/useBackendReachability.ts": "Hook performing a backend health check using an anonymous actor and reporting reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication and manages login state using Dfinity AuthClient.",
  "frontend/src/hooks/useLoadingWatchdog.ts": "A hook that triggers a timeout callback if loading takes too long, with optional enabling and cleanup logic.",
  "frontend/src/hooks/usePreserveHorizontalScroll.ts": "Preserves and restores an element’s horizontal scroll position across rerenders and updates.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor methods for user profiles, habits, and related mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind base configuration defining CSS variables for themes and global styles for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/types/investments.ts": "Legacy empty file kept for backward compatibility with investment types.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Empty type declaration file for xlsx.",
  "frontend/src/utils/diagnostics.ts": "In-memory diagnostics recorder that logs timestamped events and formats them into a timeline.",
  "frontend/src/utils/diaryAnalytics.ts": "Computes daily habit consistency percentages based on habit records and weekly targets.",
  "frontend/src/utils/diaryDates.ts": "Utility functions for formatting, parsing, and retrieving dates in YYYY-MM-DD format.",
  "frontend/src/utils/duration.ts": "Parses free-text duration strings into seconds, formats seconds back to readable strings, and validates input.",
  "frontend/src/utils/exportFormatters.ts": "Formatting helpers for export data including dates, habit units, investment amounts, and durations.",
  "frontend/src/utils/exportPdf.ts": "Generates an HTML report for reflections, habits, and investments, then triggers browser print-to-PDF.",
  "frontend/src/utils/exportXlsx.ts": "Builds tab‑delimited XLSX-like content for reflections, habits, goals, and investment entries and downloads it as a file.",
  "frontend/src/utils/fileDownload.ts": "Creates export filenames and downloads blobs via a temporary link.",
  "frontend/src/utils/habitUnit.ts": "Provides helpers for creating, labeling, detecting, and converting habit units.",
  "frontend/src/utils/investments.ts": "Formats and parses investment-related dates and amounts and computes goal progress.",
  "frontend/src/utils/reportCsv.ts": "Generates CSV content for habit records and downloads it as a file.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC components and constructs normalized date ranges for reports.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder file for PDF report generation.",
  "frontend/src/utils/reportStats.ts": "Calculates habit report statistics including completion, daily stats, and volume metrics over a date range.",
  "frontend/src/utils/steadyClimbPlan.ts": "Provides monthly Steady Climb fitness targets and maps habit names to their monthly goals.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, persisting, and clearing URL and session parameters for routing and state.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color system using CSS variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a consistency tracker app, its architecture, known issues, and required feature rollbacks to Version 35."
}