{
  "backend/main.mo": "Actor defining user profiles, habits, records, investment goals, diary entries, and access-controlled CRUD operations with internal logging and health check.",
  "feature_evidence.json": "Feature evidence report mapping month-selector requirements to affected frontend files and components with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind base/theme setup defining OKLCH color variables for light and dark modes and applying global background/text styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling identity state, profile loading, and conditional rendering of login, setup, or dashboard views.",
  "frontend/src/components/__tests__/tracker-spacing.regression.test.tsx": "Empty regression test file.",
  "frontend/src/components/AuthenticatedInitFallback.tsx": "Fallback UI shown when authenticated initialization fails, offering retry, reload, and diagnostic timeline display.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Collapsible wrapper around HabitManager that loads habits and displays a toggleable panel for managing them.",
  "frontend/src/components/DiaryAnalyticsChart.tsx": "Builds a line chart comparing diary energy levels with habit consistency for the current month. Parses diary entries, merges them with habit records, and renders using Recharts.",
  "frontend/src/components/DiaryPage.tsx": "Renders the daily reflection form with date picker, energy level, and text fields, loading and saving diary entries. Includes the analytics chart based on all diary data.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary that catches render errors and displays a custom fallback with reset support.",
  "frontend/src/components/ExportDataPage.tsx": "Provides a date‑range‑based export interface that loads data and triggers XLSX or PDF exports. Manages loading, errors, and export state.",
  "frontend/src/components/ExportDateRangePicker.tsx": "A start/end date selector with popover calendars that normalizes ranges and updates parent callbacks.",
  "frontend/src/components/ExportPreviewSections.tsx": "Displays preview sections for reflections, habit records, and investments from export data, formatting entries in cards and tables.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fallback UI for fatal errors showing the error message with options to reload or retry.",
  "frontend/src/components/HabitGrid.tsx": "Renders a habit grid for a selected month, manages habit completion toggling and amount editing, and preserves horizontal scroll state.",
  "frontend/src/components/HabitManager.tsx": "Provides UI for creating, editing, and deleting habits, including unit selection and validation for default amounts and weekly targets.",
  "frontend/src/components/Header.tsx": "Displays the page header with user info, navigation tabs, view-specific icon/title, and logout menu.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Shows an investment goal with progress, and provides dialogs for editing or deleting the goal.",
  "frontend/src/components/InvestmentsPage.tsx": "Lists investment goals and includes a dialog for creating new goals with validation.",
  "frontend/src/components/LoadingTimeoutFallback.tsx": "Fallback screen for long-loading states with backend reachability diagnostics, reload options, and copyable debug info.",
  "frontend/src/components/LoginScreen.tsx": "Login screen UI that triggers Internet Identity login and shows loading and error states.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Displays monthly target totals for applicable habits and computes progress using habit records.",
  "frontend/src/components/MonthTabs.tsx": "Scrollable month selector tabs with drag-scroll and auto-centering of the selected month.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile creation form that saves the user’s name via a mutation.",
  "frontend/src/components/ProgressCharts.tsx": "Renders monthly progress charts including pie, per‑habit bars, and daily trend data using calculated stats.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard managing views, month selection, habit data loading, and rendering habit-related components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Checks backend health by calling a healthCheck endpoint on an anonymous actor and tracks reachability state.",
  "frontend/src/hooks/useHorizontalDragScroll.ts": "Custom React hook adding horizontal drag-to-scroll behavior using mouse events and refs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity login, state, and AuthClient setup.",
  "frontend/src/hooks/useLoadingWatchdog.ts": "Watchdog hook that triggers a callback if a loading state persists beyond a timeout.",
  "frontend/src/hooks/usePreserveHorizontalScroll.ts": "Hook that stores and restores an element’s horizontal scroll position across re-renders.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend habit, profile, and related data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and global styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point wiring React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/types/investments.ts": "Deprecated placeholder file kept for backward compatibility.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration stub for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Empty type declaration stub for xlsx.",
  "frontend/src/utils/diagnostics.ts": "In-memory diagnostics logger that records timestamped events and formats them for debugging.",
  "frontend/src/utils/diaryAnalytics.ts": "Computes daily habit consistency percentages from habit definitions and records.",
  "frontend/src/utils/diaryDates.ts": "Utilities for formatting, parsing, and retrieving dates in YYYY-MM-DD format.",
  "frontend/src/utils/duration.ts": "Parses human-readable duration strings into seconds and formats seconds back to readable durations.",
  "frontend/src/utils/exportFormatters.ts": "Provides formatting helpers for dates, habit units, investment amounts, and durations.",
  "frontend/src/utils/exportPdf.ts": "Generates an HTML-based printable PDF report containing reflections, habit records, and other export data.",
  "frontend/src/utils/exportXlsx.ts": "Builds a tab‑delimited pseudo‑XLSX export with multiple sheets for reflections, habits, goals, and investment entries.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames and downloads blobs via a temporary link.",
  "frontend/src/utils/habitUnit.ts": "Utilities for creating, interpreting, and converting habit unit types for UI and logic.",
  "frontend/src/utils/investments.ts": "Formats dates and amounts for investment data and computes goal progress values.",
  "frontend/src/utils/reportCsv.ts": "Creates CSV content for habit records and provides a blob download helper.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC components and builds normalized date range structures.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder file for PDF report generation.",
  "frontend/src/utils/reportStats.ts": "Computes report statistics including habit progress, daily stats, and volume metrics over a date range.",
  "frontend/src/utils/steadyClimbPlan.ts": "Provides monthly target lookups for the Steady Climb fitness plan and retrieves targets per habit.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Describes the project’s state and requirements for fixing the MonthTabs horizontal scrolling, including existing features, issues, and pending requests."
}