{
  "backend/main.mo": "Motoko canister managing user profiles, habits, records, monthly targets, and investment goals with access-controlled CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to tracking‑grid behaviors, month-switching rules, and key‑scoping requirements.",
  "frontend-file-summaries.txt": "Collected short descriptions of all major frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile initialization, and routing to the dashboard.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Expandable panel wrapping HabitManager with a collapsible UI control.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component rendering a fallback UI on unhandled errors.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fatal error screen providing reload and retry options when the app crashes.",
  "frontend/src/components/HabitGrid.tsx": "Daily tracking grid enforcing month/year filtering, scoped record keys, and completion/amount editing logic.",
  "frontend/src/components/HabitManager.tsx": "Provides UI to create, edit, and delete habits with validation for units, weekly targets, and default amounts.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with user info, theme toggle, logout, and view mode switching between habits and investments.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Displays an investment goal with progress and dialogs to edit, delete, or log contributions.",
  "frontend/src/components/InvestmentsPage.tsx": "Lists investment goals and includes a form for creating new goals with basic validation.",
  "frontend/src/components/LoginScreen.tsx": "Shows a login page using Internet Identity with branding and a login button.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Lets users view and edit monthly habit targets, using auto-plan defaults and persisted overrides.",
  "frontend/src/components/MonthTabs.tsx": "Provides horizontally scrollable tabs for selecting months.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a profile setup form allowing users to enter and save their name via a mutation and shows success or error toasts.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly habit progress visuals including pie, line, and volume charts, with habit selection and lifetime data integration.",
  "frontend/src/components/ReportExportDialog.tsx": "Provides a dialog for exporting habit data to CSV with date range selection, habit filtering, and mutation-based data retrieval.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard that manages view mode, loads habits and records, and displays habit grids, charts, and management panels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity storage, status tracking, and session management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, habits, and mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark theme colors.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf.",
  "frontend/src/utils/duration.ts": "Parses human‑readable duration strings to seconds and formats seconds back to readable strings.",
  "frontend/src/utils/fileDownload.ts": "Builds export filenames based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Helpers for labeling, creating, and checking habit unit types.",
  "frontend/src/utils/reportCsv.ts": "Generates downloadable CSV reports from export data.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC components and formats UTC dates for reporting.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder for PDF report utilities.",
  "frontend/src/utils/reportStats.ts": "Computes completion, daily, and volume statistics for habits over a date range.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements and issues for fixing month‑separated daily‑tracker data persistence and rendering behavior."
}