{
  "backend/main.mo": "Main canister logic handling user profiles, habits, records, investment goals, monthly targets, and authorization with AccessControl and migration support.",
  "backend/migration.mo": "Migration module defining old/new actor states and returning existing state unchanged for upgrades.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, related components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their responsibilities and behaviors.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light/dark theme variables and global styling.",
  "frontend/index.html": "Root HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile setup flow, theme provider, error boundary, and dashboard rendering.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "UI panel providing a collapsible wrapper around the HabitManager component for adding and managing habits.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that captures render errors and displays a custom fallback.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fallback UI shown on fatal errors with reload and retry options.",
  "frontend/src/components/HabitGrid.tsx": "Renders a grid of habits by day, allowing toggling completion and editing time/amount values with mutation calls. Builds a record map, manages editing state, and validates parsed duration or numeric inputs before saving.",
  "frontend/src/components/HabitManager.tsx": "Provides a UI to create, edit, update, and delete habits, including weekly targets, units, and default amounts. Validates inputs, parses durations, and triggers corresponding mutation hooks.",
  "frontend/src/components/Header.tsx": "Displays the app header with user info, theme toggle, view mode switching, and logout. Also shows the report export dialog when in habits view.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Shows an investment goal with progress, and supports editing, deleting, and logging contributions through dialogs. Uses mutation hooks to update backend goal data.",
  "frontend/src/components/InvestmentsPage.tsx": "Lists investment goals and provides a form to create new ones. Validates input values and submits new goals via mutation hooks.",
  "frontend/src/components/LoginScreen.tsx": "Simple login screen using Internet Identity with branding and a login button. Displays loading state during authentication.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Editor for setting monthly habit targets, loading habits and existing targets, with auto-plan defaults and save/update logic.",
  "frontend/src/components/MonthTabs.tsx": "Horizontal scrollable month selector using tab components, calling a callback when the selected month changes.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form allowing a user to enter and save their name via mutation.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly progress charts and volume stats for habits using Recharts with selectable habit views and lifetime totals.",
  "frontend/src/components/ReportExportDialog.tsx": "Dialog for exporting habit data as CSV, supporting date range selection and optional habit filtering.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard combining habit management, monthly targets, charts, and investment view with month selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading/storing identity, login/logout, and managing AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating user profiles, habits, and related habit data through the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file for jspdf.",
  "frontend/src/utils/duration.ts": "Utilities for parsing free‑text time durations into seconds and formatting seconds into readable strings.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Helpers to create, interpret, and label HabitUnit types and convert them for UI usage.",
  "frontend/src/utils/reportCsv.ts": "Builds CSV export content for habits and records and triggers CSV file download.",
  "frontend/src/utils/reportDateRange.ts": "Helpers for converting dates to UTC components and formatting them for reports.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder for PDF report utilities.",
  "frontend/src/utils/reportStats.ts": "Calculates report statistics including habit performance, daily stats, and volume metrics over a date range.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in session storage, and managing hash‑based routing params.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH-based color system, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state for habit-target features, listing requirements, known issues, and pending feature requests related to monthly targets and UI cleanup."
}