{
  "backend/main.mo": "Motoko backend defining user profiles, habits, records, diary entries, investment tracking, and access‑controlled CRUD operations with internal logging and health check.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind‑based global styles defining OKLCH theme tokens, dark mode variables, and base layout rules.",
  "frontend/index.html": "Minimal HTML shell mounting the React app via root div and module script entrypoint.",
  "frontend/src/App.tsx": "Root React component handling authentication gating, silent retries, user profile loading, and rendering either LoginScreen, ProfileSetup, or TrackerDashboard.",
  "frontend/src/components/__tests__/tracker-spacing.regression.test.tsx": "Empty test file placeholder.",
  "frontend/src/components/AuthenticatedInitFallback.tsx": "Empty placeholder component file with no implemented logic.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Collapsible panel that loads habits and displays the HabitManager with loading state handling.",
  "frontend/src/components/DiaryAnalyticsChart.tsx": "Component computing and rendering a line chart correlating diary energy levels with habit consistency for the current month.",
  "frontend/src/components/DiaryPage.tsx": "Diary entry page with date picker, reflection fields, data loading, parsing, and saving diary entries.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches errors and renders a fallback with reset support.",
  "frontend/src/components/ExportDataPage.tsx": "Page for selecting a date range, loading exportable data, and exporting it to XLSX or PDF.",
  "frontend/src/components/ExportDateRangePicker.tsx": "Date range selector ensuring valid start/end ordering using popover calendar pickers.",
  "frontend/src/components/ExportPreviewSections.tsx": "Renders preview sections for reflections, habit records, and investments within the selected export range.",
  "frontend/src/components/FatalErrorFallback.tsx": "UI fallback for fatal errors with options to reload or retry.",
  "frontend/src/components/HabitGrid.tsx": "Monthly habit grid displaying records, supporting completion toggling, amount editing, and scroll preservation.",
  "frontend/src/components/HabitManager.tsx": "UI component for creating, editing, and deleting habits with validation and unit handling.",
  "frontend/src/components/Header.tsx": "App header showing navigation tabs, user info, and logout menu based on current view.",
  "frontend/src/components/InAppInitStatus.tsx": "Empty component file with no implementation.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Card component displaying an investment goal with edit and delete dialogs and progress calculation.",
  "frontend/src/components/InvestmentsPage.tsx": "Page showing a list of investment goals and a dialog to create new ones.",
  "frontend/src/components/LoadingTimeoutFallback.tsx": "Empty component file with no implementation.",
  "frontend/src/components/LoginScreen.tsx": "Login screen using Internet Identity with loading, error display, and login button.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Displays monthly target and progress summaries for applicable habits by filtering habits, summing monthly records, and formatting totals.",
  "frontend/src/components/MonthTabs.tsx": "Scrollable month selector tabs with drag-to-scroll and auto-centering of the selected month.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a profile setup form allowing users to enter and save their name with basic validation and status feedback.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly progress visuals including a pie chart, per-habit progress bars, and daily trend data using calculated stats.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard managing navigation, data loading, month selection, and rendering habit tracking, charts, and auxiliary pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useHorizontalDragScroll.ts": "Implements horizontal drag-to-scroll behavior using mouse events for overflow containers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identities and login/logout flows for the app.",
  "frontend/src/hooks/useLoadingWatchdog.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/usePreserveHorizontalScroll.ts": "Hook that preserves and restores a horizontal scroll position using refs and event listeners.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, habits, and related backend data.",
  "frontend/src/hooks/useSilentActorRetry.ts": "Silent retry mechanism that reinitializes the actor with exponential backoff when authenticated.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark mode.",
  "frontend/src/main.tsx": "App entry that sets up React Query and Internet Identity providers and renders the app.",
  "frontend/src/types/investments.ts": "Deprecated placeholder file kept for backwards compatibility.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration stub for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Empty type declaration stub for xlsx.",
  "frontend/src/utils/diagnostics.ts": "In-memory diagnostics logger that records events and formats them into a timeline.",
  "frontend/src/utils/diaryAnalytics.ts": "Computes daily habit consistency percentages based on habits and records.",
  "frontend/src/utils/diaryDates.ts": "Helpers for formatting, parsing, and generating YYYY-MM-DD date strings.",
  "frontend/src/utils/duration.ts": "Parses human-readable time durations into seconds and formats seconds back into strings.",
  "frontend/src/utils/exportFormatters.ts": "Formatting helpers for export data including dates, habit units, and numeric amounts.",
  "frontend/src/utils/exportPdf.ts": "Generates a printable HTML-based PDF export of diary entries and habit records.",
  "frontend/src/utils/exportXlsx.ts": "Builds a multi‑sheet tab‑delimited XLSX-like file from export data and triggers a download.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames and provides a helper to download Blob objects.",
  "frontend/src/utils/habitUnit.ts": "Handles HabitUnit creation, labeling, type checks, and conversions for UI use.",
  "frontend/src/utils/investments.ts": "Formats and parses investment-related dates and amounts and computes goal progress.",
  "frontend/src/utils/reportCsv.ts": "Converts habit records into escaped CSV content and provides a CSV download helper.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC components and constructs normalized date ranges.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder for PDF report utilities.",
  "frontend/src/utils/reportStats.ts": "Calculates habit performance, daily stats, and volume metrics for a reporting range.",
  "frontend/src/utils/steadyClimbPlan.ts": "Defines monthly fitness targets and retrieves values per habit and month.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current state and requirements for enforcing Internet Identity login, using authenticated backend access, auto-loading user data, and removing the Connection Issue UI. Includes known issues, architectural notes, and new feature requests tied to these changes."
}