{
  "backend/main.mo": "Main canister implementing user profiles, habits, records, monthly targets, and authorization‑protected CRUD logic.",
  "backend/migration.mo": "No‑op migration module passing version 18 state through unchanged.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Precomputed summaries describing each frontend file’s purpose and version‑18 behavior.",
  "frontend/index.css": "Tailwind base theme definitions providing OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level app with hardened startup logic choosing login, profile setup, or dashboard and wrapped in an ErrorBoundary.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "UI panel that toggles open to reveal the HabitManager component.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary capturing render errors and showing a custom fallback.",
  "frontend/src/components/FatalErrorFallback.tsx": "Full‑screen fatal error UI showing error details with reload and retry options.",
  "frontend/src/components/HabitGrid.tsx": "Renders a calendar-style grid for habits, showing daily completion and amount editing with mutation-based updates.",
  "frontend/src/components/HabitManager.tsx": "Provides UI and logic to create, edit, and delete habits, including unit and default amount handling.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, user greeting, and logout menu.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/InvestmentsPage.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoginScreen.tsx": "Shows the login UI using Internet Identity with branding and loading states.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Calculates and displays monthly totals for applicable habits based on completed records.",
  "frontend/src/components/MonthTabs.tsx": "Horizontal tab list for switching between months.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile by submitting a name to backend storage.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly progress visuals including pie, bar, and line charts using computed habit statistics.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard component that loads habits and records, manages month selection, and renders habit manager, targets editor, grid, and charts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for loading and mutating habits, records, and user profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up react-query, and wraps the app with the Internet Identity provider.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file reserved for jsPDF typings.",
  "frontend/src/utils/duration.ts": "Parses free‑text durations into seconds, formats seconds into readable strings, and validates duration inputs.",
  "frontend/src/utils/fileDownload.ts": "Generates standardized filenames for CSV or PDF exports based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Utility helpers for creating, identifying, and labeling habit units, including custom and time-based units.",
  "frontend/src/utils/reportCsv.ts": "Generates a CSV export of habit data and triggers file download.",
  "frontend/src/utils/reportDateRange.ts": "Provides helpers for converting dates to UTC components and formatting date ranges.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder file for PDF report utilities.",
  "frontend/src/utils/reportStats.ts": "Calculates habit, daily, and volume statistics for a reporting period.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugins.",
  "project_state.json": "Describes the project state, features, architecture notes, and known issues for the habit tracker app."
}