{
  "backend/main.mo": "Motoko canister implementing user profiles, habits, habit records, and access control with create/delete and profile save/query operations.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens for light and dark modes and applying base styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication and deterministic user profile loading before rendering login, setup, or dashboard.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Collapsible panel wrapper around HabitManager with toggle button and animated open/close state.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component capturing exceptions and rendering a custom fallback.",
  "frontend/src/components/FatalErrorFallback.tsx": "UI fallback shown on fatal errors with reload and retry options.",
  "frontend/src/components/HabitGrid.tsx": "Interactive habit grid allowing completion toggles and amount editing with validation and backend updates.",
  "frontend/src/components/HabitManager.tsx": "Form UI for creating, editing, and deleting habits with validation and mutation hooks.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app title, user info, theme toggle, CSV export, and logout menu.",
  "frontend/src/components/LoginScreen.tsx": "Login page using Internet Identity with branding and a single login button.",
  "frontend/src/components/MonthTabs.tsx": "Scrollable tab list allowing selection of a month by index.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form that saves the user's name via a mutation.",
  "frontend/src/components/ProgressCharts.tsx": "Monthly progress visuals including pie, line, and volume charts computed from habit records.",
  "frontend/src/components/ReportExportDialog.tsx": "Dialog for exporting habit data to CSV with date range and habit selection options.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard combining habit management, month selection, tracking grid, and progress charts.",
  "frontend/src/hooks/useActor.ts": "Creates a reactive backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout helpers, and loads stored identities using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for loading and mutating user profiles, habits, and related records via the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom light/dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration placeholder for jsPDF.",
  "frontend/src/utils/duration.ts": "Parses free-text duration strings into seconds and formats/validates duration values.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames for CSV/PDF based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Utilities for converting, labeling, and creating HabitUnit values for UI and backend use.",
  "frontend/src/utils/reportCsv.ts": "Builds and downloads CSV export reports using habit, record, and profile data.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC components, builds date ranges, and formats UTC dates.",
  "frontend/src/utils/reportPdf.ts": "Empty placeholder for PDF report utilities.",
  "frontend/src/utils/reportStats.ts": "Computes habit, daily, and volume statistics over a date range using habits and their records, producing overall percentages and detailed per-habit metrics.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear or retrieve them with precedence rules.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, radii, animations, plugins, and project-wide styling settings.",
  "project_state.json": "Describes the project’s current state, features, and versions, including authentication, RBAC, habits, and analytics capabilities."
}