{
  "backend/main.mo": "Motoko canister managing user profiles, habits, habit records, and authorization with CRUD operations and validation.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files.",
  "frontend/index.css": "Tailwind base style definitions and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component handling authentication, profile loading, error states, and routing to dashboard or setup.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "Collapsible panel wrapping the HabitManager with UI toggle controls.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that captures runtime errors and renders a fallback.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fallback UI card for fatal errors with reload and retry actions.",
  "frontend/src/components/HabitGrid.tsx": "Scrollable habit grid with preserved horizontal scroll, month-scoped records, and inline completion/amount editing.",
  "frontend/src/components/HabitManager.tsx": "Provides UI and logic for creating, editing, and deleting habits with validation and unit handling.",
  "frontend/src/components/Header.tsx": "Renders the app header with user info and a logout dropdown.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Empty component file.",
  "frontend/src/components/InvestmentsPage.tsx": "Empty component file.",
  "frontend/src/components/LoginScreen.tsx": "Displays a login screen using Internet Identity with branding and a login button.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Calculates and displays monthly target totals for applicable habits based on records and steady-climb rules.",
  "frontend/src/components/MonthTabs.tsx": "Renders a horizontal tab list for selecting months with clamped parsing.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form to set and save the user's name during profile setup.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly progress pie chart, per-habit progress bars, and daily trend chart using computed stats.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty component file.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard composing header, habit manager, targets, grid, and charts with month switching and data loading.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, loading stored identities, and handling login/logout states.",
  "frontend/src/hooks/usePreserveHorizontalScroll.ts": "Tracks and restores horizontal scroll position for a mounted element across re-renders.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, habits, and related data through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration placeholder for jsPDF.",
  "frontend/src/utils/duration.ts": "Parses human‑readable durations into seconds, formats seconds into strings, and validates duration input.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames for reports based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Helpers for converting, labeling, and identifying habit unit types.",
  "frontend/src/utils/reportCsv.ts": "Generates CSV export content from habit data and triggers CSV downloads.",
  "frontend/src/utils/reportDateRange.ts": "Provides helpers to extract UTC date components, convert date ranges, and format UTC dates.",
  "frontend/src/utils/reportPdf.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/reportStats.ts": "Computes habit report statistics, including percentages, daily stats, and volume metrics for a given date range.",
  "frontend/src/utils/steadyClimbPlan.ts": "Supplies monthly Steady Climb workout targets and resolves targets for specific habit names.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing current issues, features, and requirements for maintaining daily tracking scroll position."
}