{
  "backend/main.mo": "Main canister defining user profiles, habits, records, investment diary types, access control, and related query/update methods with logging and migration support.",
  "backend/migration.mo": "No-op migration module that maps old actor state to the new structure without transformation.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind-based global style layer defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML template mounting the React application and loading the main entry script.",
  "frontend/src/App.tsx": "Top-level application logic handling identity, actor readiness, profile loading, diagnostics, timeouts, and rendering the appropriate UI state.",
  "frontend/src/components/CollapsibleHabitManagerPanel.tsx": "UI panel providing a collapsible wrapper around the HabitManager component for toggling habit management visibility.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that captures rendering errors and displays a provided fallback UI.",
  "frontend/src/components/FatalErrorFallback.tsx": "Fallback UI for unrecoverable errors offering reload and retry actions with error details.",
  "frontend/src/components/HabitGrid.tsx": "Renders a scrollable habit grid for a selected month with record mapping, editing, and completion toggling.",
  "frontend/src/components/HabitManager.tsx": "Provides UI and logic to create, edit, update, and delete habits including units, targets, and default amounts.",
  "frontend/src/components/Header.tsx": "Displays the app header with navigation tabs, user info, and logout options.",
  "frontend/src/components/InvestmentGoalCard.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/InvestmentsPage.tsx": "Manages investment diary entries and goal creation with dialogs, validation, and loading states.",
  "frontend/src/components/LoadingTimeoutFallback.tsx": "Shows a diagnostic fallback UI when loading stalls, including backend reachability checks and debug export.",
  "frontend/src/components/LoginScreen.tsx": "Displays the login interface using Internet Identity with branding and a login button.",
  "frontend/src/components/MonthlyTargetsEditor.tsx": "Renders monthly habit targets by filtering applicable habits and computing monthly totals and targets from records.",
  "frontend/src/components/MonthTabs.tsx": "Renders horizontally scrollable month tabs that clamp and emit month selections.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a simple form to save a user's name and create their profile with validation and feedback.",
  "frontend/src/components/ProgressCharts.tsx": "Generates monthly progress visuals including a pie chart, per-habit progress bars, and daily trend data using calculated stats.",
  "frontend/src/components/ReportExportDialog.tsx": "Empty file or placeholder for a report export dialog component.",
  "frontend/src/components/TrackerDashboard.tsx": "Main dashboard coordinating habit data, monthly records, views, and child components like charts, grids, and target editors.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity changes, refetching dependent queries when the actor updates.",
  "frontend/src/hooks/useBackendReachability.ts": "Checks whether the backend is reachable by calling a diagnostic method and reporting status with logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identities, and related status tracking.",
  "frontend/src/hooks/useLoadingWatchdog.ts": "Implements a timeout watchdog that triggers a callback if a loading state exceeds a specified duration.",
  "frontend/src/hooks/usePreserveHorizontalScroll.ts": "Hook that tracks and restores an element’s horizontal scroll position across renders.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, habits, and mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "App entry that initializes React Query and Internet Identity providers and renders the app.",
  "frontend/src/types/investments.ts": "Defines the InvestmentGoal interface mirroring backend types.",
  "frontend/src/types/jspdf.d.ts": "Empty declaration file placeholder for jspdf typings.",
  "frontend/src/utils/diagnostics.ts": "In-memory diagnostics logger that records events with timestamps and formats timelines.",
  "frontend/src/utils/duration.ts": "Utilities to parse, validate, and format time durations in seconds.",
  "frontend/src/utils/fileDownload.ts": "Generates export filenames based on date ranges.",
  "frontend/src/utils/habitUnit.ts": "Helpers for converting and checking HabitUnit values and creating unit definitions.",
  "frontend/src/utils/investments.ts": "Formatting helpers for dates and amounts plus investment progress calculations.",
  "frontend/src/utils/reportCsv.ts": "Generates CSV export of habits and records and triggers client-side download.",
  "frontend/src/utils/reportDateRange.ts": "Converts dates to UTC-based components and formats them for reports.",
  "frontend/src/utils/reportPdf.ts": "Empty file for future PDF report generation.",
  "frontend/src/utils/reportStats.ts": "Calculates habit report statistics including per-habit progress, daily completion stats, and volume metrics over a date range.",
  "frontend/src/utils/steadyClimbPlan.ts": "Provides monthly fitness targets and helpers to look up targets for supported habits based on month.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and enabled plugins.",
  "project_state.json": "Tracks the project state and requirements for adding an Investment Diary and multi-goal Investment Goals module."
}