{
  "kind": "build_request",
  "title": "Fix immediate startup crash: userProfile.name undefined",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Prevent the app from rendering the authenticated dashboard until the caller user profile query has deterministically resolved (either a real profile object or an explicit null), so that no code path can access `userProfile.name` while `userProfile` is undefined on initial load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "1. Yes \n2. Yes, immediately \n3. Yes just to load"
        ]
      },
      "acceptanceCriteria": [
        "On an authenticated session, the app does not render `TrackerDashboard` until `useGetCallerUserProfile()` has resolved to either `UserProfile` or `null` (never `undefined`).",
        "The fatal error screen shown in the screenshot (\"undefined is not an object (evaluating 'userProfile.name')\") no longer appears on initial page load.",
        "If the caller has no profile, the app shows the Profile Setup screen instead of crashing.",
        "If the caller has a profile, the app shows the dashboard and the header renders the welcome message without errors."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a defensive UI safeguard so that the header/user badge rendering never throws if a profile object is unexpectedly missing or has an empty name (e.g., render a safe fallback initial and omit the welcome name) to avoid taking down the whole app due to a single missing field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Yes, immediately"
        ]
      },
      "acceptanceCriteria": [
        "No part of the header crashes when `userProfile.name` is empty or missing; the UI renders with a safe fallback instead.",
        "The app remains usable (no ErrorBoundary fatal fallback) even if the profile data is malformed, and the user can still log out."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend.immutablePaths (including frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/*).",
    "Respect the existing single-page flow: unauthenticated => LoginScreen, authenticated without profile => ProfileSetup, authenticated with profile => TrackerDashboard."
  ],
  "nonGoals": [
    "Do not implement PDF export (frontend/src/utils/reportPdf.ts placeholder).",
    "Do not change backend data models, RBAC, or stable storage behavior as part of this fix.",
    "Do not address other known issues (e.g., toggleHabitCompletion amount upsert behavior, habit ID generation, reportStats month-length handling, CSV quote escaping) unless required to fix the startup crash."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}