{
  "kind": "build_request",
  "title": "Fix MonthTabs horizontal scrolling to access all months (Jan–Dec)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the month selector in `frontend/src/components/MonthTabs.tsx` so users can horizontally scroll to reach all months (January–December), including months before May, on both desktop (mouse/trackpad) and mobile (touch swipe).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I can’t scroll to the months before May as shown in the image attached. Can you make it so I can scroll through all months?"
        ]
      },
      "acceptanceCriteria": [
        "On a narrow viewport, the month tabs row is horizontally scrollable and allows reaching January–April and November–December.",
        "Horizontal scrolling works via touch swipe on mobile devices and via trackpad/mouse wheel/drag on desktop.",
        "Scrolling is not blocked by a parent element; the month tabs container provides the horizontal overflow region."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the month selector allows partial month visibility while scrolling (i.e., tabs can be partially visible at the left/right edges), rather than forcing full-tab snapping or fitting all tabs into the available width.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do you want the scroll bar to show partial months (like April in your screenshot), or should all month tabs be fully visible as you scroll?",
          "2. Yes"
        ]
      },
      "acceptanceCriteria": [
        "While scrolling the month tab strip, tabs can be partially visible at the edges (no forced snapping to whole tabs).",
        "Tabs do not wrap to multiple lines; the row remains a single horizontal strip."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep the default visible/selected month as the current month on initial load, and ensure the selected month tab is brought into view within the scrollable month selector if it would otherwise be off-screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Should the default visible month remain the current month, or change to something else?",
          "3. Yes"
        ]
      },
      "acceptanceCriteria": [
        "On initial load, the selected month remains the current month (existing behavior preserved).",
        "If the selected month tab is not fully visible, the month selector auto-scrolls so the selected tab is visible without requiring manual scrolling."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add/extend frontend tests to cover the month selector scrollability regression (months before May must remain reachable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make it so I can scroll through all months?"
        ]
      },
      "acceptanceCriteria": [
        "At least one automated test asserts the MonthTabs renders all 12 month triggers and the container is configured for horizontal overflow (e.g., via classnames/attributes expected by the implementation).",
        "Tests fail if MonthTabs is changed in a way that removes horizontal scrolling or wraps tabs."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only Shadcn components); compose them from app components instead.",
    "Keep all changes within the existing React + TypeScript + Tailwind stack; no new frameworks.",
    "Backend changes are not required for this fix; do not alter Motoko state or APIs."
  ],
  "nonGoals": [
    "Redesigning the dashboard layout beyond the month tab scrolling behavior.",
    "Changing how months/years are calculated or fetched in the backend.",
    "Adding new calendar features (year switching, date pickers, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}