{
  "kind": "build_request",
  "title": "Revert app to Version 18 consistency tracker and unblock deploy/publish with safe state compatibility",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make Version 18 the active codebase by fully reverting both frontend and backend behavior to the Version 18 consistency tracker (Habits UI) referenced in this conversation, removing/rolling back any Version 19–23 changes that could be causing deployment/publish to fall back to a newer version and blocking release.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create version 18 - consistency app tracker"
        ]
      },
      "acceptanceCriteria": [
        "A fresh draft build uses the Version 18 Habits tracker UX (monthly tabs, habit grid, progress charts, habit management) and does not unexpectedly include newer-version-only behavior.",
        "The resulting draft can be deployed and then published without the platform reverting to another version during publish.",
        "The app loads successfully (no blank/white screen) through initial render, login, profile load, and dashboard render."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the reverted Version 18 backend runs safely on the existing canister state by adding/maintaining Motoko upgrade migration logic that can read any newer stored stable state and convert it into a Version 18-compatible stable state without data loss for Version 18 entities (user profiles, habits, records, monthly targets).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure the reverted Version 18 backend runs safely on the existing canister state by providing/maintaining Motoko upgrade migration logic that converts any newer stored stable state into the Version 18-compatible stable state without data loss for Version 18 entities (user profiles, habits, records, monthly targets)."
        ]
      },
      "acceptanceCriteria": [
        "On canister upgrade, previously saved user data (profiles, habits, records, monthly targets) remains available after upgrade for the same Internet Identity principal.",
        "Upgrade does not trap due to unexpected/unknown stable-state variants/fields from newer versions.",
        "Migration is idempotent (re-running on already-migrated state does not corrupt or change data)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a regression-safe startup path so the UI never renders a blank white screen on initial load: ensure all required data is null-safe during initial render and that any fatal rendering errors are caught and presented via the existing error boundary fallback UI instead of a blank screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "App is just showing as blank white screen. Can you fix?",
          "The draft when I open is just a blank white screen"
        ]
      },
      "acceptanceCriteria": [
        "If a runtime/render error occurs during initial boot, the app shows the FatalErrorFallback UI rather than a blank white screen.",
        "Normal boot (no errors) shows a loading state, then login or dashboard depending on authentication/profile state.",
        "No direct access of possibly-undefined profile properties during initial render (e.g., avoid crashes like userProfile.name undefined)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or the immutable hook/bootstrap files listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features beyond restoring Version 18 behavior and ensuring safe state compatibility.",
    "Integrations with external databases or third-party auth providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}