{
  "kind": "build_request",
  "title": "Restore app to Version 35 (last working build)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore and redeploy the full application (frontend and backend) to the exact code and configuration of Version 35, replacing the currently deployed Version 36.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Restore to 35"
        ]
      },
      "acceptanceCriteria": [
        "The deployed app corresponds to Version 35 (both frontend assets and backend canister code).",
        "Version 36 is no longer served to users after deployment."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After restoring Version 35, verify end-to-end initialization works for an authenticated user: Internet Identity login completes, the backend actor becomes available, and the app proceeds past initialization to the normal UI (Profile Setup for new users or the Dashboard for existing users) without getting stuck on the loading watchdog/timeout screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Restore to 35"
        ]
      },
      "acceptanceCriteria": [
        "A user can log in with Internet Identity and reach the app’s main flow (no persistent 'initializing' state).",
        "The app does not show 'Loading Timeout' during normal startup under typical conditions.",
        "Backend reachability (healthCheck) succeeds and the UI continues to load after the check."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths; compose existing components instead if any UI adjustments are required as part of the restore."
  ],
  "nonGoals": [
    "Do not implement new features or redesign UI; this change is strictly a rollback to Version 35.",
    "Do not attempt to diagnose or permanently fix the underlying initialization/backend deployment issue beyond restoring the last known working version."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}