{
  "kind": "build_request",
  "title": "Replace Monthly Targets with calendar-mapped 'Steady Climb' plan (push-ups, squats, plank)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Monthly Targets panel to use the 'Steady Climb' year plan values (from uploaded image IMG_3316-1.jpeg) as the monthly targets for Push-ups/Press-ups, Squats, and Plank, replacing the current Monthly Targets behavior shown in IMG_3328.jpeg.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For monthly targets, can you get the image 3328 to go in line with 3316 ie targets for each month will incrementally increase",
          "1. Yes",
          "2. Yes"
        ]
      },
      "acceptanceCriteria": [
        "In the Monthly Targets card, the displayed target for each applicable habit matches the Steady Climb plan values for the selected month.",
        "Push-ups and Press-ups share the same monthly target values (treated as the same plan habit).",
        "Squats monthly target values match the Steady Climb plan values.",
        "Plank monthly target values match the Steady Climb plan values and are displayed as a duration (e.g., 1:15) rather than raw seconds.",
        "The UI no longer presents these values as 'totals based on completed daily entries' (i.e., remove/replace copy that implies the numbers are computed totals rather than plan targets)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Map the Steady Climb plan months to calendar months (January = Month 1, February = Month 2, …, December = Month 12) when rendering targets for the currently selected month in the dashboard month tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3. Targets map to calendar"
        ]
      },
      "acceptanceCriteria": [
        "Selecting January shows Month 1 targets; selecting February shows Month 2 targets; … selecting December shows Month 12 targets.",
        "Month switching via the existing MonthTabs updates the targets accordingly without requiring any backend writes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep showing the user's completed monthly totals derived from habit records, but present them separately from the plan target (e.g., show both 'Total' and 'Target' for each applicable habit within the Monthly Targets panel).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "replace the existing Monthly Targets shown in 3328"
        ]
      },
      "acceptanceCriteria": [
        "For each applicable habit row, the UI displays both (a) completed monthly total computed from records and (b) the Steady Climb plan target for the selected month.",
        "For time-based habits (e.g., Plank), both Total and Target are formatted using the existing duration formatting (frontend/src/utils/duration.ts).",
        "If there are no applicable habits, the existing empty-state remains, but its text should not claim targets are computed from completed entries."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify the Internet Identity or actor hooks in frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths).",
    "Backend is single-actor (backend/main.mo); avoid introducing additional backend services."
  ],
  "nonGoals": [
    "Do not add a new 'Year Plan' section/page; the Steady Climb plan should replace the current Monthly Targets behavior in the existing panel.",
    "Do not introduce third-party integrations or external data sources for targets.",
    "Do not change how records are created/toggled or how charts are computed beyond what is necessary to display Total vs Target in the Monthly Targets panel."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}