{
  "kind": "build_request",
  "title": "Fix monthly targets: press-ups & squats steady-climb defaults; disable targets for fasting/run/squash; clean up targets UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Monthly Targets auto-plan defaults so that both “Press-ups” and “Squats” receive monthly-increasing targets that climb by +5 each month according to the Steady Climb plan shown in the uploaded image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "As per the image attached, can you add target for press-ups and squats (increasing by 5 every month based on steady climb plan image."
        ]
      },
      "acceptanceCriteria": [
        "In the Monthly Targets list, a habit named “Press-ups” displays an auto-plan target (not “—”) for any selected month in the year.",
        "In the Monthly Targets list, a habit named “Squats” displays an auto-plan target (not “—”) for any selected month in the year.",
        "The Press-ups and Squats auto-plan values increase by 5 month-over-month across the 12 months (e.g., Jan 20, Feb 25, Mar 30 ...).",
        "Auto-plan matching is robust to common naming variants such as “Press-ups” vs “Push-ups” (i.e., press-ups no longer fails to match due to name normalization)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix Monthly Targets to correctly show and edit persisted monthly target overrides from the backend (instead of always showing only the auto-plan default and ignoring saved values).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Press-ups and squash habits didn’t update.",
          "can you add target for press-ups and squats"
        ]
      },
      "acceptanceCriteria": [
        "If a user saves a monthly target for a habit/month/year, returning to that same month/year shows the saved value in the targets list.",
        "When tapping Edit for a habit, the input is prefilled with the saved monthly target if one exists for the selected month/year; otherwise it is prefilled with the auto-plan default (if available) or blank.",
        "Saving a new target value updates the backend and the UI reflects the updated value without a full page refresh.",
        "Time-based habits (e.g., Plank) still support duration parsing/formatting when displaying saved overrides and when prefilling the edit input."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove monthly target functionality from “16/8 fasting”, “Run”, and “Squash” so targets are not shown as applicable and cannot be edited for these habits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Can you remove target for 16/8 fasting, run and squash as this is not applicable to these?"
        ]
      },
      "acceptanceCriteria": [
        "For habits named “16/8 fasting”, “Run”, or “Squash”, the Monthly Targets list does not show an editable target value (no target number/duration) and does not show an Edit button.",
        "These habits do not display auto-plan default targets even if a default would otherwise be inferred.",
        "Other habits (e.g., Plank, Press-ups, Squats) continue to show targets and remain editable."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Clean up the Monthly Targets section layout to look less messy (consistent spacing/alignment and clearer separation between habit name, target display, and edit controls), matching the structure shown in the uploaded image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "If you can also make the target section more clean - it looks a bit messy currently with the way it’s laid out"
        ]
      },
      "acceptanceCriteria": [
        "Each habit row has consistent alignment for name, target text, and action buttons across all rows.",
        "When a row is in edit mode, Save/Cancel and the input do not cause the row height to jump excessively or misalign adjacent content.",
        "The list remains readable on mobile widths similar to the screenshot (no overlapping text/buttons)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify any frontend paths listed as immutable in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration only if state schema changes are required."
  ],
  "nonGoals": [
    "Adding new habits or changing existing habit units beyond monthly-target display/edit behavior.",
    "Adding third-party integrations, notifications, or real-time syncing.",
    "Redesigning other dashboard sections outside the Monthly Targets area."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}