{
  "kind": "build_request",
  "title": "Make monthly targets equal summed daily completed amounts (Steady Climb rules)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the habit tracking logic so that for applicable habits (e.g., press-ups, squats, plank), the monthly target value for a given habit+month+year is always the sum of that habit’s daily completed entries in the same month+year, updating immediately after each tick/untick or amount edit.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-8",
          "msg-6"
        ],
        "quotes": [
          "Implement now",
          "Immediately",
          "See attached - in march it should be 30 of each for squats/ press-ups and plank 1:30. It’s showing wrong value"
        ]
      },
      "acceptanceCriteria": [
        "When a user marks a day as completed for an applicable habit in the Daily Tracking grid, the corresponding month’s value shown in Monthly Targets updates without requiring a page refresh.",
        "When a user unticks a completed day for an applicable habit, the corresponding month’s value shown in Monthly Targets decreases accordingly.",
        "When a user edits and saves an amount/duration for a completed day, the corresponding month’s value shown in Monthly Targets recalculates accordingly.",
        "Only records whose (month, year) match the selected month/year are included in the monthly sum.",
        "For time-based habits (e.g., plank), the monthly sum is the total duration (seconds) across all completed days in that month, displayed formatted (e.g., 1:30).",
        "For non-time numeric habits (e.g., reps), the monthly sum is the total numeric amount across all completed days in that month.",
        "Days with no amount value entered contribute 0 to the monthly sum (not 1).",
        "Non-applicable habits (e.g., 16/8 fasting, run, squash) are not forced into this monthly-sum behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Backend: persist the computed monthly summed value per habit+month+year so that Monthly Targets always show the correct total after reload and across devices/sessions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-6"
        ],
        "quotes": [
          "Yes",
          "See attached - in march it should be 30 of each for squats/ press-ups and plank 1:30. It’s showing wrong value"
        ]
      },
      "acceptanceCriteria": [
        "After toggling and/or editing amounts in a month, reloading the app preserves the same Monthly Targets values for that month.",
        "The backend recalculates and stores the monthly target for that habit+month+year whenever toggleHabitCompletion adds/removes a record or changes a record amount.",
        "The stored monthly target for a habit+month+year equals the sum of amounts of completed records for that habit in that month+year (amount null counts as 0)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Frontend: ensure the Monthly Targets view reflects the month/year the user is currently working in (the month selected in the Habits dashboard), and it displays the persisted computed monthly sum for each applicable habit for that same month/year.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "See attached - in march it should be 30 of each for squats/ press-ups and plank 1:30. It’s showing wrong value"
        ]
      },
      "acceptanceCriteria": [
        "When the user switches months in the dashboard (e.g., February → March), the Monthly Targets panel updates to show targets for the same selected month/year.",
        "The Monthly Targets panel shows values that match the backend-computed sums for the selected month/year.",
        "The Monthly Targets panel formats time habit sums as durations (e.g., 90 seconds shown as 1:30)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit frontend files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Introducing external databases or third-party backend services.",
    "Building real-time syncing (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}