{
  "kind": "build_request",
  "title": "Prevent Daily Tracking grid from jumping to day 1 when toggling completion",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Daily Tracking (HabitGrid) horizontal scroll behavior so that marking a habit as complete/incomplete does not reset the horizontal scroll position to the far left (day 1). The scroll position must remain exactly where the user left it (e.g., when viewing day 15).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make it so it doesn’t jump when I tick it complete? Ie if I’m on 15th it will jump to the 1st when I click it",
          "1. Yes \n2. Yes \n3. Correct"
        ]
      },
      "acceptanceCriteria": [
        "From the Daily Tracking grid, horizontally scroll to a later day (e.g., day 15) and toggle any checkbox; the grid remains scrolled to the same position after the UI updates.",
        "The same non-jumping behavior applies when saving an amount in the popover (for unit-based habits).",
        "No visual unmount/remount of the grid occurs during the completion toggle that would cause the scroll position to reset."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust loading states for the Daily Tracking grid so background refetches triggered by toggling completion do not replace the grid with the 'Loading...' card/skeleton (which causes scroll reset). Preserve the existing full-page initial loading behavior, and keep month switching behavior sensible without breaking scroll preservation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when I select a box on daily habits to complete a task it jumps to the very left"
        ]
      },
      "acceptanceCriteria": [
        "Toggling a habit completion does not show the HabitGrid loading skeleton card; the grid remains rendered while data refreshes.",
        "Initial page load can still show the existing loading UI when data has not loaded yet.",
        "Switching months continues to work correctly and does not corrupt the displayed records for the newly selected month/year."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Keep the backend architecture unchanged (single Motoko actor); this change should be frontend-only unless a backend issue is discovered."
  ],
  "nonGoals": [
    "Adding new habit features or changing the habit completion data model.",
    "Changing authentication (Internet Identity) flows.",
    "Redesigning the dashboard layout beyond what is necessary to prevent scroll jumps."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}