{
  "kind": "build_request",
  "title": "Force Internet Identity login on launch and silently retry backend initialization (remove Connection Issue banner)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Require Internet Identity authentication before rendering any Consistency Tracker UI (no dashboard, header, or pages visible until the user is signed in) and, after sign-in, load the user’s previously stored data (profile, habits, records, diary, investments) tied to their Internet Identity principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Connect it to backend Ask for internet identity sign in and load into previous data",
          "1 yes 2 yes",
          "Yes all information."
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load while signed out, the app renders only the login screen and no tracker/dashboard content.",
        "After successful Internet Identity login, the app creates an authenticated backend actor (non-anonymous identity) and React Query data loads are enabled for the signed-in principal.",
        "If the signed-in user already has stored data in the backend, that data appears in the UI without manual steps (e.g., existing habits and records load)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Remove the in-app “Connection Issue” banner and its “Retry Connection” button from the dashboard experience, and do not present backend/initialization failures as blocking UI. Backend failures should retry silently in the background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Should I completely remove the current “Connection Issue” banner and retry button from the UI since login will always occur first?",
          "Confirmed"
        ]
      },
      "acceptanceCriteria": [
        "The “Connection Issue” alert (title and description) is no longer rendered in the dashboard.",
        "The “Retry Connection” button is no longer present anywhere in the app UI.",
        "When backend queries fail transiently, the app does not show a blocking error screen or connection banner; it continues to display the signed-in app shell and retries in the background."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Adjust frontend query/retry behavior so authenticated data loading is resilient: initialization/data queries should retry automatically with a non-aggressive delay strategy, without requiring user interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If the backend fails: show nothing, just retry silently.",
          "Resolve issues"
        ]
      },
      "acceptanceCriteria": [
        "When the backend is temporarily unavailable after login, the app does not require the user to click any retry UI to recover.",
        "Once the backend becomes available again, the user’s data loads automatically without a page refresh.",
        "Retry behavior is bounded and does not spam requests continuously (uses React Query retry + retryDelay or an equivalent backoff)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components must be composed, not modified).",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; create backend/migration.mo only if existing stable state requires migration."
  ],
  "nonGoals": [
    "Adding new product features beyond login/startup flow and backend connectivity (e.g., new tracking modules, new pages).",
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}