{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Preserve HabitGrid horizontal scroll position during completion toggles and background refetches",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Preserve Daily Tracking (HabitGrid) horizontal scroll position when toggling completion or saving an amount so the grid does not jump back to day 1.",
      "acceptanceCriteria": [
        "From the Daily Tracking grid, horizontally scroll to a later day (e.g., day 15) and toggle any checkbox; the grid remains scrolled to the same position after the UI updates.",
        "The same non-jumping behavior applies when saving an amount in the popover (for unit-based habits).",
        "No visual unmount/remount of the grid occurs during the completion toggle that would cause the scroll position to reset."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePreserveHorizontalScroll.ts",
          "operation": "create",
          "description": "Create a small React hook to capture and restore a scroll container's horizontal scrollLeft across re-renders/data updates (e.g., store last known scrollLeft in a ref, expose a ref callback to locate the actual scrolling viewport element, and a restore function/effect trigger)."
        },
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Update HabitGrid to preserve horizontal scroll position across completion toggles and amount saves: keep a stable reference to the ScrollArea viewport, record scrollLeft on user scroll, and restore the same scrollLeft after records/UI updates. Also ensure mapped habit rows do not cause remounting by using a keyed React.Fragment (or another stable keyed wrapper) for each habit row group."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Adjust HabitGrid loading states so background refetches from toggles do not replace the grid with a loading skeleton while preserving initial full-page loading and keeping month switching correct.",
      "acceptanceCriteria": [
        "Toggling a habit completion does not show the HabitGrid loading skeleton card; the grid remains rendered while data refreshes.",
        "Initial page load can still show the existing loading UI when data has not loaded yet.",
        "Switching months continues to work correctly and does not corrupt the displayed records for the newly selected month/year."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Change the logic that passes loading state into HabitGrid so that background refetching (e.g., after toggleHabitCompletion invalidation) does not trigger a grid-replacing loading state. Preserve the existing full-page initial loading UI, and pass a non-destructive 'refreshing' signal to HabitGrid for month switching/background refetches (so the grid stays mounted)."
        },
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Remove/avoid the grid-replacing 'Loading...' skeleton behavior for non-initial fetches. Keep the grid rendered while data refreshes and (optionally) show a lightweight inline 'updating' indicator inside the existing Card header/content without unmounting the ScrollArea."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the monthly records query behavior to support sensible month switching without corrupting displayed records (e.g., avoid placeholder data patterns that cause transient incorrect renders; ensure switching month/year results in the grid showing only records matching the selected month/year while fetching completes)."
        }
      ]
    }
  ]
}