{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Daily Tracking month-isolated rendering and record lookup",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Daily Tracking displays and applies completion/amount values only for the currently selected month/year, with no bleed-over between months and correct reload behavior.",
      "acceptanceCriteria": [
        "After completing a habit day in February, switching to March shows March data only (unchecked/empty unless March has saved completions).",
        "After completing a habit day in March, switching back to February shows February data only; February and March do not affect each other.",
        "Reloading the app preserves month-specific completion data (data is persisted in the backend and correctly reloaded per selected month/year)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Make the grid defensively month/year-scoped: filter incoming records to the selectedMonth/selectedYear before building any lookup, and ensure displayed completion/amount state is derived only from records matching the currently selected month/year."
        },
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Update any in-memory record lookup map keys to include habitId + day + month + year, and update editingCell keys accordingly so switching months cannot reuse/collide with a previous month’s cell state."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Ensure HabitGrid/ProgressCharts receive month-isolated records only for the current selection (e.g., pass a cleared array while loading new month data, and otherwise pass the current query’s resolved records for the selected month/year)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent the previous month’s records from rendering while a newly selected month/year’s records are loading by showing a cleared grid or loading/skeleton state.",
      "acceptanceCriteria": [
        "Switching from February to March does not temporarily or permanently show February checkmarks/amounts under March.",
        "If the selected month’s data is still loading, the UI indicates loading (or shows a cleared grid) rather than showing the last month’s data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the monthly records query behavior to avoid showing stale/previous-month data during month changes (e.g., return an empty placeholder while fetching the new month/year and ensure the query does not keep prior data visible for a different queryKey)."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "On month switch, ensure the grid does not render the last resolved month’s records (e.g., derive recordsForUI = recordsLoading/isFetching ? [] : records, and pass isLoading to HabitGrid to show its skeleton/cleared state)."
        },
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Ensure the loading/empty rendering path results in an unchecked/empty grid presentation for the selected month (e.g., rely on isLoading skeleton and/or empty records array without residual checked state)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make Daily Tracking record mapping robust against month/year collisions by using month/year in client-side lookup keys/maps.",
      "acceptanceCriteria": [
        "Client-side record lookup keys used by the grid uniquely identify a record by habitId + day + month + year.",
        "No completion/amount display can be caused by a record from a different month/year due to key collisions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Change the recordMap key from habitId-day to habitId-day-month-year and update all reads/writes to that key so records from different months/years cannot collide in memory."
        },
        {
          "path": "frontend/src/components/HabitGrid.tsx",
          "operation": "modify",
          "description": "Update any other per-cell keys derived from habitId/day (e.g., editingCell identifiers and popover input ids) to include month/year to prevent UI state collisions across month switches."
        }
      ]
    }
  ]
}