{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Steady Climb monthly targets as summed daily completions (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Monthly Targets update immediately to equal the sum of completed daily amounts for applicable habits in the selected month/year (including time formatting and 0 for missing amounts).",
      "acceptanceCriteria": [
        "When a user marks a day as completed for an applicable habit in the Daily Tracking grid, the corresponding month’s value shown in Monthly Targets updates without requiring a page refresh.",
        "When a user unticks a completed day for an applicable habit, the corresponding month’s value shown in Monthly Targets decreases accordingly.",
        "When a user edits and saves an amount/duration for a completed day, the corresponding month’s value shown in Monthly Targets recalculates accordingly.",
        "Only records whose (month, year) match the selected month/year are included in the monthly sum.",
        "For time-based habits (e.g., plank), the monthly sum is the total duration (seconds) across all completed days in that month, displayed formatted (e.g., 1:30).",
        "For non-time numeric habits (e.g., reps), the monthly sum is the total numeric amount across all completed days in that month.",
        "Days with no amount value entered contribute 0 to the monthly sum (not 1).",
        "Non-applicable habits (e.g., 16/8 fasting, run, squash) are not forced into this monthly-sum behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the toggleHabitCompletion mutation to optimistically update the cached monthly records for the active month/year (add/remove completion and set/clear amount) so UI-derived monthly sums update immediately after tick/untick/amount save; also invalidate any monthly-target query keys that depend on the affected habit+month+year to stay consistent with persisted computed totals."
        },
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Change Monthly Targets to compute and display the monthly summed value for applicable habits from the currently loaded monthly records (treat missing amount as 0; sum seconds for time habits and format using formatDuration; sum numeric amounts for others) so the panel updates immediately as the grid changes; keep non-applicable habits excluded from forced sum behavior."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Wire the dashboard’s selectedMonth/selectedYear and current month records into MonthlyTargetsEditor as props so it can render sums for the active working month/year and react immediately to changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure Monthly Targets always reflects the dashboard-selected month/year and shows backend-persisted computed sums (with time formatting).",
      "acceptanceCriteria": [
        "When the user switches months in the dashboard (e.g., February → March), the Monthly Targets panel updates to show targets for the same selected month/year.",
        "The Monthly Targets panel shows values that match the backend-computed sums for the selected month/year.",
        "The Monthly Targets panel formats time habit sums as durations (e.g., 90 seconds shown as 1:30)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor monthly-target data hooks to align with the typed backend interface (use getMonthlyTarget(habitId, month, year) rather than untyped multi-month retrieval) and provide a query keyed by habitId+month+year; ensure invalidation ties to the selected month/year."
        },
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Remove the editor-controlled month/year selectors and instead consume the selectedMonth/selectedYear from the dashboard; for applicable habits, display the persisted backend-computed monthly sum for that same month/year, with a fallback to the immediately-derived sum from current records while queries are fetching; format time units via formatDuration."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Pass selectedMonth/selectedYear into MonthlyTargetsEditor and ensure month switching triggers the corresponding monthly-target queries for that same month/year (no stale month/year state inside MonthlyTargetsEditor)."
        }
      ]
    }
  ]
}