{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Force Internet Identity login gating and silent backend retry (remove Connection Issue UI)",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Gate all Consistency Tracker UI behind Internet Identity login and load the signed-in principal’s existing data after authentication.",
      "acceptanceCriteria": [
        "On a fresh load while signed out, the app renders only the login screen and no tracker/dashboard content.",
        "After successful Internet Identity login, the app creates an authenticated backend actor (non-anonymous identity) and React Query data loads are enabled for the signed-in principal.",
        "If the signed-in user already has stored data in the backend, that data appears in the UI without manual steps (e.g., existing habits and records load)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the signed-out state renders only <LoginScreen /> (no header/dashboard/pages). After authentication, enable data-loading flows using the authenticated actor, and keep profile setup as the only pre-dashboard UI for first-time principals. Use the authorization selected component guidance to keep app data hidden until authenticated (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Tighten React Query hook enablement to require a non-anonymous Internet Identity principal (not just a truthy identity) before running any profile/habits/records/diary/investments queries, ensuring data loads are always tied to the signed-in principal. Align with the authorization selected component expectations for authenticated data access (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Remove the “Connection Issue” banner and “Retry Connection” button and avoid blocking UI on backend/initialization failures.",
      "acceptanceCriteria": [
        "The “Connection Issue” alert (title and description) is no longer rendered in the dashboard.",
        "The “Retry Connection” button is no longer present anywhere in the app UI.",
        "When backend queries fail transiently, the app does not show a blocking error screen or connection banner; it continues to display the signed-in app shell and retries in the background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Remove rendering of the in-dashboard initialization status UI so the dashboard never shows a connection banner or retry button; keep the signed-in shell visible regardless of transient backend failures."
        },
        {
          "path": "frontend/src/components/InAppInitStatus.tsx",
          "operation": "delete",
          "description": "Delete the component that renders the “Connection Issue” banner and “Retry Connection” button to ensure it cannot appear anywhere in the UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove any remaining init-error plumbing (e.g., hasInitError/onRetryInit) that exists solely to drive the Connection Issue banner, and ensure the signed-in app shell remains non-blocking even if initialization/data queries temporarily fail."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Make authenticated data loading resilient by adding bounded, non-aggressive automatic retries and silent re-initialization attempts without user interaction.",
      "acceptanceCriteria": [
        "When the backend is temporarily unavailable after login, the app does not require the user to click any retry UI to recover.",
        "Once the backend becomes available again, the user’s data loads automatically without a page refresh.",
        "Retry behavior is bounded and does not spam requests continuously (uses React Query retry + retryDelay or an equivalent backoff)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the React Query QueryClient defaultOptions to use bounded retries with a non-aggressive retryDelay/backoff for queries, so transient backend failures recover automatically without user action."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust key authenticated queries (profile, habits, records, diary, investments) to use bounded retry behavior consistent with app-wide defaults (avoid retry:false for core bootstrap queries), and ensure failures do not trigger blocking UI states."
        },
        {
          "path": "frontend/src/hooks/useSilentActorRetry.ts",
          "operation": "create",
          "description": "Create a small hook that, when authenticated and the backend actor is not yet available, schedules silent background re-attempts by invalidating the actor query with bounded exponential backoff (no user-facing UI)."
        }
      ]
    }
  ]
}