{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Monthly habit target overrides editor + lifetime totals in progress UI",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add monthly targets editor UI with month/year selection, per-habit override editing/clearing, and duration-friendly inputs for time habits",
      "acceptanceCriteria": [
        "UI provides controls to select the active month (1-12) and year, reusing the existing month-tab UX pattern where appropriate.",
        "For each habit, UI shows the current month’s target value: (a) manual override value if set; otherwise (b) auto-plan default if available; otherwise blank/none.",
        "User can set/update/clear a manual override for a habit’s monthly target.",
        "For time-based targets (e.g., Plank), the editor accepts and displays durations in a human-friendly format consistent with existing duration utilities (e.g., \"1 min 15 sec\", \"1:15\").",
        "Saving changes shows success/error feedback using the existing toast pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "create",
          "description": "Create a monthly targets editor card that lists habits and lets the user view/edit/clear month-specific target overrides; use existing duration utilities for time habits and the existing toast pattern for success/error feedback."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Wire the MonthlyTargetsEditor into the Habits view (no new top-level routes), and update state to allow selecting both month and year (month uses existing MonthTabs; add a year control alongside)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update progress UI to show both this-month progress and all-time totals with clear labeling and correct formatting by unit",
      "acceptanceCriteria": [
        "Progress UI includes an All time section (or toggle) that displays lifetime totals per habit using the new backend lifetime totals query.",
        "Monthly views continue to use existing monthly records fetching and calculations for month-scoped progress.",
        "Time-based lifetime volumes are formatted as durations; rep-based lifetime volumes are shown as numbers.",
        "UI copy is in English and clearly distinguishes month-scoped vs lifetime totals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProgressCharts.tsx",
          "operation": "modify",
          "description": "Add an \"All time\" section (or toggle) that renders per-habit lifetime totals (frequency + volume where applicable), while keeping existing monthly charts unchanged; format time volumes with existing duration formatting and label scopes clearly in English."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add React Query hooks for monthly targets (by month/year) and lifetime totals with cache invalidation aligned to existing patterns",
      "acceptanceCriteria": [
        "New hooks exist for: fetching monthly targets for (month, year), updating a monthly target override, and fetching lifetime totals.",
        "Mutations invalidate the correct queries (monthly targets for the affected month/year, and any UI relying on targets/totals).",
        "Hooks follow the conventions used in frontend/src/hooks/useQueries.ts (actor availability checks, enabled gating with identity/actor state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for (a) fetching monthly targets for a selected month/year, (b) upserting/clearing a monthly target override with proper invalidation, and (c) fetching lifetime totals; follow existing actor/identity enabled gating and queryKey conventions."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend type declarations to include the new monthly-targets-by-(month,year) query capability and the lifetime-totals query return types consumed by the new hooks/components."
        }
      ]
    }
  ]
}