{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert frontend to Version 18 Habits tracker and harden startup against blank screens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revert the frontend to the Version 18 Habits tracker UX and remove newer-version-only UI surface area that could affect deploy/publish consistency.",
      "acceptanceCriteria": [
        "A fresh draft build uses the Version 18 Habits tracker UX (monthly tabs, habit grid, progress charts, habit management) and does not unexpectedly include newer-version-only behavior.",
        "The resulting draft can be deployed and then published without the platform reverting to another version during publish.",
        "The app loads successfully (no blank/white screen) through initial render, login, profile load, and dashboard render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Rework MonthlyTargetsEditor to match the Version 18 monthly-targets behavior (per-habit monthly target viewing/editing alongside actual month-to-date totals) using existing query/mutation hooks (e.g., targets fetch + update). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align React Query keys/invalidation and target-related hooks usage to the Version 18 tracker flow (monthly target read/write coherence with month switching and habit mutations), keeping behavior consistent with the Habits UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the dashboard composition matches Version 18 (month tabs + habit grid + progress charts + habit management + monthly targets) and remove/avoid any conditional UI paths that introduce newer-version-only behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/InvestmentsPage.tsx",
          "operation": "delete",
          "description": "Remove newer-version placeholder page that is not part of the Version 18 Habits tracker to reduce risk of version drift during deploy/publish."
        },
        {
          "path": "frontend/src/components/InvestmentGoalCard.tsx",
          "operation": "delete",
          "description": "Remove newer-version placeholder component that is not part of the Version 18 Habits tracker to reduce risk of version drift during deploy/publish."
        },
        {
          "path": "frontend/src/components/ReportExportDialog.tsx",
          "operation": "delete",
          "description": "Remove newer-version placeholder export dialog component (not part of the Version 18 baseline) to reduce risk of version drift during deploy/publish."
        },
        {
          "path": "frontend/src/utils/reportPdf.ts",
          "operation": "delete",
          "description": "Remove unused placeholder PDF export utility (not required for Version 18 baseline) to reduce risk of version drift during deploy/publish."
        },
        {
          "path": "frontend/src/types/jspdf.d.ts",
          "operation": "delete",
          "description": "Remove unused placeholder type definition tied to the removed PDF export placeholder to reduce risk of version drift during deploy/publish."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Prevent blank/white screen on boot by making initial render null-safe and ensuring fatal render errors surface via the existing FatalErrorFallback error boundary UI.",
      "acceptanceCriteria": [
        "If a runtime/render error occurs during initial boot, the app shows the FatalErrorFallback UI rather than a blank white screen.",
        "Normal boot (no errors) shows a loading state, then login or dashboard depending on authentication/profile state.",
        "No direct access of possibly-undefined profile properties during initial render (e.g., avoid crashes like userProfile.name undefined)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden the boot state machine: ensure the authenticated/profile-loading path cannot render ProfileSetup/Dashboard until profile query is definitively resolved; handle query errors deterministically (surface through the existing ErrorBoundary/FatalErrorFallback), and eliminate any ambiguous falsy checks that can cause incorrect screens or crashes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TrackerDashboard.tsx",
          "operation": "modify",
          "description": "Add defensive rendering guards for early/transition states (e.g., month/records/habits loading) to ensure child components never receive inconsistent/undefined data during initial boot or month switches. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Make startup data hooks regression-safe by ensuring actor/identity dependencies prevent throws during initial render, and that hook return flags (isLoading/isFetched) reliably represent readiness to render downstream UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure user profile display remains null-safe (name/initial fallbacks) and cannot throw during any transitional render while identity/profile data settles. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}