{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard Monthly Targets: Steady Climb plan targets + calendar-month mapping + Total vs Target",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace computed-only Monthly Targets with Steady Climb plan targets for Push-ups/Press-ups, Squats, and Plank (plank as duration).",
      "acceptanceCriteria": [
        "In the Monthly Targets card, the displayed target for each applicable habit matches the Steady Climb plan values for the selected month.",
        "Push-ups and Press-ups share the same monthly target values (treated as the same plan habit).",
        "Squats monthly target values match the Steady Climb plan values.",
        "Plank monthly target values match the Steady Climb plan values and are displayed as a duration (e.g., 1:15) rather than raw seconds.",
        "The UI no longer presents these values as 'totals based on completed daily entries' (i.e., remove/replace copy that implies the numbers are computed totals rather than plan targets)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/steadyClimbPlan.ts",
          "operation": "create",
          "description": "Add a Steady Climb year plan lookup (Month 1..12) for Push-ups/Press-ups, Squats, and Plank, including plank targets stored as seconds to enable formatting via existing duration utilities."
        },
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Use the Steady Climb plan lookup to derive the displayed Target values for applicable habits (push-ups/press-ups share the same plan target; squats and plank use their respective targets), and replace any copy implying targets are computed totals."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Map Steady Climb plan months directly to calendar months when switching via existing MonthTabs.",
      "acceptanceCriteria": [
        "Selecting January shows Month 1 targets; selecting February shows Month 2 targets; … selecting December shows Month 12 targets.",
        "Month switching via the existing MonthTabs updates the targets accordingly without requiring any backend writes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Treat selectedMonth (1-12) as the Steady Climb plan month index when picking plan targets so MonthTabs selection drives Steady Climb Month N targets with no backend interaction."
        },
        {
          "path": "frontend/src/components/MonthTabs.tsx",
          "operation": "modify",
          "description": "Harden MonthTabs month parsing to ensure month values remain numeric 1-12 (e.g., explicit base-10 parsing and simple clamping/guard) so calendar selection reliably maps to Steady Climb Month 1..12."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show completed monthly totals separately from Steady Climb plan targets (Total + Target per habit row) with correct duration formatting for time-based habits.",
      "acceptanceCriteria": [
        "For each applicable habit row, the UI displays both (a) completed monthly total computed from records and (b) the Steady Climb plan target for the selected month.",
        "For time-based habits (e.g., Plank), both Total and Target are formatted using the existing duration formatting (frontend/src/utils/duration.ts).",
        "If there are no applicable habits, the existing empty-state remains, but its text should not claim targets are computed from completed entries."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTargetsEditor.tsx",
          "operation": "modify",
          "description": "Update each applicable habit row to render both 'Total' (computed from records) and 'Target' (from Steady Climb plan), formatting time-based totals/targets with formatDuration and updating the empty-state wording to avoid claiming targets are computed."
        }
      ]
    }
  ]
}