{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback frontend behavior to Version 35 and confirm authenticated initialization flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the frontend code/configuration to match Version 35 so Version 36 is no longer served.",
      "acceptanceCriteria": [
        "The deployed app corresponds to Version 35 (both frontend assets and backend canister code).",
        "Version 36 is no longer served to users after deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Revert App initialization, routing, and watchdog/timeout behavior to the exact Version 35 implementation (no new flows). Ensure the authenticated gating logic matches Version 35. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Revert actor creation and authenticated initialization behavior to the exact Version 35 implementation, including any access-control bootstrap sequencing used in Version 35. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Revert Internet Identity session loading, login status transitions, and identity persistence behavior to the exact Version 35 implementation to ensure Version 35 auth lifecycle semantics. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Revert React Query enablement/loading semantics for profile and other authenticated queries to match Version 35 (including any safeguards against premature profile fetch before actor readiness). Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LoadingTimeoutFallback.tsx",
          "operation": "modify",
          "description": "Revert the loading-timeout fallback UI/logic to the exact Version 35 implementation (copy, actions, and reachability messaging) so behavior matches Version 35. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthenticatedInitFallback.tsx",
          "operation": "modify",
          "description": "Revert authenticated initialization recovery UI/logic to the exact Version 35 implementation so authenticated failures present the Version 35 recovery experience. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useBackendReachability.ts",
          "operation": "modify",
          "description": "Revert backend reachability check behavior to the exact Version 35 implementation to ensure the same health-check timing/behavior as the last working build. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/diagnostics.ts",
          "operation": "modify",
          "description": "Revert diagnostics recording/formatting to the exact Version 35 implementation so troubleshooting output matches Version 35. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Revert the React app bootstrap/provider wiring to the exact Version 35 implementation (QueryClientProvider + InternetIdentityProvider order and configuration) to match Version 35 runtime behavior. Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the authenticated initialization path (II login → actor available → profile routing) proceeds to Profile Setup or Dashboard without getting stuck on timeout screens (as in Version 35).",
      "acceptanceCriteria": [
        "A user can log in with Internet Identity and reach the app’s main flow (no persistent 'initializing' state).",
        "The app does not show 'Loading Timeout' during normal startup under typical conditions.",
        "Backend reachability (healthCheck) succeeds and the UI continues to load after the check."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Align the authenticated initialization state machine with Version 35 so the app reliably transitions from identity readiness to actor availability to profile routing (ProfileSetup for new users, TrackerDashboard for existing users) without entering an indefinite initializing state. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure actor readiness semantics match Version 35 so dependent queries only run once the authenticated actor is usable, preventing initialization deadlocks that can trigger timeout fallbacks. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the current-user profile query gating/loading flags match Version 35 so the UI does not get stuck waiting on profile fetch states and avoids triggering timeout fallbacks under typical startup conditions. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Ensure Version 35 identity initialization/login status behavior so authenticated users do not remain in an initializing state and the UI can proceed to the main flow. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useBackendReachability.ts",
          "operation": "modify",
          "description": "Ensure backend health-check behavior matches Version 35 so reachability succeeds under normal conditions and any status reporting does not block continuing to the main UI. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LoadingTimeoutFallback.tsx",
          "operation": "modify",
          "description": "Ensure Version 35 timeout fallback behavior and messaging so it is not shown during normal startup and remains purely a recovery UI when initialization genuinely exceeds Version 35 thresholds. Verify the authorization component's usage instructions before implementing."
        }
      ]
    }
  ]
}