{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix MonthTabs horizontal scrolling for all months (Jan–Dec)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the MonthTabs strip reliably horizontally scrollable for all months on desktop and mobile, with the overflow region owned by the month tabs container.",
      "acceptanceCriteria": [
        "On a narrow viewport, the month tabs row is horizontally scrollable and allows reaching January–April and November–December.",
        "Horizontal scrolling works via touch swipe on mobile devices and via trackpad/mouse wheel/drag on desktop.",
        "Scrolling is not blocked by a parent element; the month tabs container provides the horizontal overflow region."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthTabs.tsx",
          "operation": "modify",
          "description": "Update the MonthTabs DOM structure and Tailwind classes so the tabs remain in a single horizontal strip with a dedicated scroll container (e.g., overflow-x-auto, overflow-y-hidden, whitespace-nowrap/flex-nowrap) and add desktop-friendly interactions (pointer drag-to-scroll and/or wheel-to-horizontal translation) while preserving existing Shadcn Tabs composition. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useHorizontalDragScroll.ts",
          "operation": "create",
          "description": "Add a small React hook to enable pointer-based drag scrolling for a horizontal overflow container (mouse/trackpad-friendly) and expose the necessary handlers/refs for MonthTabs to attach. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure MonthTabs scrolling permits partial tab visibility at edges, with no wrapping and no forced snapping behavior.",
      "acceptanceCriteria": [
        "While scrolling the month tab strip, tabs can be partially visible at the edges (no forced snapping to whole tabs).",
        "Tabs do not wrap to multiple lines; the row remains a single horizontal strip."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthTabs.tsx",
          "operation": "modify",
          "description": "Ensure no scroll-snap behavior is applied and avoid any layout classes that force full-tab fitting; keep a single-line non-wrapping strip (e.g., whitespace-nowrap + flex-nowrap) so tabs can be partially visible at the left/right edges during scroll. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Preserve current-month default selection and auto-scroll the selected month tab into view on load and when selection changes.",
      "acceptanceCriteria": [
        "On initial load, the selected month remains the current month (existing behavior preserved).",
        "If the selected month tab is not fully visible, the month selector auto-scrolls so the selected tab is visible without requiring manual scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthTabs.tsx",
          "operation": "modify",
          "description": "Add selected-tab focusing/visibility behavior (e.g., measure container + selected trigger and scroll as needed, or use scrollIntoView with nearest/inline options) so the selected month is brought into view on mount and on selectedMonth changes, without changing how TrackerDashboard sets the initial selectedMonth. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add automated regression tests to ensure MonthTabs renders all months and remains horizontally scrollable and non-wrapping.",
      "acceptanceCriteria": [
        "At least one automated test asserts the MonthTabs renders all 12 month triggers and the container is configured for horizontal overflow (e.g., via classnames/attributes expected by the implementation).",
        "Tests fail if MonthTabs is changed in a way that removes horizontal scrolling or wraps tabs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/__tests__/tracker-spacing.regression.test.tsx",
          "operation": "modify",
          "description": "Implement a regression test for MonthTabs using the existing test placeholder: render MonthTabs with 12 months, assert all triggers are present, and assert the scroll container/list includes the specific non-wrapping + horizontal overflow signals introduced by the implementation (classnames and/or data attributes). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MonthTabs.tsx",
          "operation": "modify",
          "description": "Add stable test hooks (e.g., data-testid/data attributes on the scroll container and tab strip) that the regression test can assert to detect loss of horizontal overflow or introduction of wrapping. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}