{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Habit tracking app with monthly-adjustable targets (auto-increase per a progression plan), a simple monthly editor, and tracking for both monthly progress and lifetime totals.",
  "architectural_notes": [
    "Store per-habit targets by month (history) and also maintain a lifetime total aggregation for completions."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-a-simple-monthly-targets-editor-ui-that-lets-the-user-select-a-month-year-and-view-edit-the-target-for-each-habit-for-that-specific-month-with-defaults-auto-filled-from-the-steady-climb-plan-when-applicable",
      "title": "Add a simple monthly targets editor UI that lets the user select a month/year and view/edit the target for each habit for that specific month, with defaults auto-filled from the \"Steady Climb\" plan when applicable.",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-progress-ui-to-display-both-monthly-progress-and-lifetime-totals-frequency-and-volume-where-applicable-and-clearly-label-which-scope-is-being-shown-this-month-vs-all-time",
      "title": "Update the progress UI to display both monthly progress and lifetime totals (frequency and volume where applicable), and clearly label which scope is being shown (This month vs All time).",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "feature-add-react-query-hooks-for-the-new-monthly-target-and-lifetime-total-backend-apis-following-existing-hook-patterns-and-ensuring-appropriate-cache-invalidation-so-the-editor-and-dashboards-stay-in-sync",
      "title": "Add React Query hooks for the new monthly-target and lifetime-total backend APIs, following existing hook patterns and ensuring appropriate cache invalidation so the editor and dashboards stay in sync.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add monthly-adjustable habit targets that auto-increase by month based on an uploaded progression plan image; provide a simple editor; track both monthly progress and lifetime totals.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add backend support for per-habit, per-month targets (month + year) that can be retrieved and updated by the authenticated caller, while preserving the existing habit CRUD and daily record tracking behavior.",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement backend auto-target defaults based on the uploaded \"Steady Climb\" year plan when no manual monthly override exists, using calendar month number as plan month index (Jan=1 ... Dec=12) for these habits: Push-ups, Squats, Plank.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add backend support for lifetime (all-time) totals per habit so the frontend can display both monthly and total progress without exporting all data.",
      "reqIds": [
        "REQ-12"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Monthly-adjustable habit targets with auto-progression plan and lifetime totals",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}