{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Consistency Tracker app: implement mandatory Internet Identity sign-in on launch, connect to Motoko backend canister, and load each user’s previously stored data automatically; remove the current Connection Issue banner/retry UI.",
  "architectural_notes": [
    "Use Internet Identity to create an authenticated canister actor; all backend reads/writes must be per-user based on the authenticated principal.",
    "App startup flow: block app UI behind mandatory Internet Identity login, then initialize authenticated actor and fetch all persisted data.",
    "On backend connection failure: avoid showing the old Connection Issue UI; retry silently (per confirmed behavior)."
  ],
  "known_issues": [
    "Current build shows a 'can’t connect to the backend' / Connection Issue banner; likely due to missing authenticated actor/II login integration."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-require-internet-identity-authentication-before-rendering-any-consistency-tracker-ui-no-dashboard-header-or-pages-visible-until-the-user-is-signed-in-and-after-sign-in-load-the-user-s-previously-stored-data-profile-habits-records-diary-investments-tied-to-their-internet-identity-principal",
      "title": "Require Internet Identity authentication before rendering any Consistency Tracker UI (no dashboard, header, or pages visible until the user is signed in) and, after sign-in, load the user’s previously stored data (profile, habits, records, diary, investments) tied to their Internet Identity principal.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-the-in-app-connection-issue-banner-and-its-retry-connection-button-from-the-dashboard-experience-and-do-not-present-backend-initialization-failures-as-blocking-ui-backend-failures-should-retry-silently-in-the-background",
      "title": "Remove the in-app “Connection Issue” banner and its “Retry Connection” button from the dashboard experience, and do not present backend/initialization failures as blocking UI. Backend failures should retry silently in the background.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-adjust-frontend-query-retry-behavior-so-authenticated-data-loading-is-resilient-initialization-data-queries-should-retry-automatically-with-a-non-aggressive-delay-strategy-without-requiring-user-interaction",
      "title": "Adjust frontend query/retry behavior so authenticated data loading is resilient: initialization/data queries should retry automatically with a non-aggressive delay strategy, without requiring user interaction.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Connect frontend to Motoko backend canister using authenticated actor after Internet Identity login",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Require Internet Identity sign-in on app launch (no UI before login)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "After login, automatically load all previously stored user-specific data from backend",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Remove the 'Connection Issue' banner and retry button UI; handle backend failures by retrying silently",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Force Internet Identity login on launch and silently retry backend initialization (remove Connection Issue banner)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}